src/artillery/artillery-demo.yml
config:
  target: 'http://localhost:8080'
  phases:
    - arrivalRate: 10
    - duration: 30
      arrivalRate: 10
      rampTo: 50
  payload:
    - path: "../test/resources/cars.csv"
      fields:
        - "vin"

scenarios:
  - flow:
    - get:
        url: "/cars"
    - get:
        url: "/cars/{{ vin }}"